Repository: pingfangx/TranslatorX-other
Catalog: JavaTutorial/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The Thread class defines a number of methods useful for thread management.
zh_cn: Thread 类定义了大量的方法用于线程管理。

source: The counter field is shared between two threads, A and B. Suppose thread A increments counter:
zh_cn: 该counter 字段由两个线程共享：A 和 B。假定线程 A 对 counter进行自增操作：

source: The java.util.concurrent package defines three executor interfaces:
zh_cn: java.util.concurrent 包中定义了三个执行器接口：

source: The java.util.concurrent package includes a number of additions to the Java Collections Framework.
zh_cn: java.util.concurrent 包囊括了 Java 集合框架的一些附加类。

source: The join method allows one thread to wait for the completion of another.
zh_cn: join 方法允许一个线程等待另一个完成。

source: The sleep method can also be used for pacing, as shown in the example that follows, and waiting for another thread with duties that are understood to have time requirements, as with the SimpleThreads example in a later section.
zh_cn: sleep 方法可以用来起搏，如下面的例子所示。也可以用来等待其他有时间要求的线程，如再下面的SimpleThreads 例子所示。

source: The tryLock method backs out if the lock is not available immediately or before a timeout expires (if specified).
zh_cn: 如果当前锁对象不可用，或者锁请求超时（如果超时时间已指定），tryLock 方法会收回获取锁的请求。

source: The lockInterruptibly method backs out if another thread sends an interrupt before the lock is acquired.
zh_cn: 如果在锁获取前，另一个线程发送了一个中断，lockInterruptibly 方法也会收回获取锁的请求。

source: The Runnable object is passed to the Thread constructor, as in the HelloRunnable example:
zh_cn: Runnable 对象传递给 Thread 的构造方法，如HelloRunnable 的示例：

source: The submit method returns a Future object, which is used to retrieve the Callable return value and to manage the status of both Callable and Runnable tasks.
zh_cn: submit 方法返回一个 Future 对象，可以用来读取 Callable 返回的结果，或者管理 Callable 和 Runnable 任务的状态。

source: The Interrupt Status Flag
zh_cn: 中断状态标志

source: The Java platform is designed from the ground up to support concurrent programming, with basic concurrency support in the Java programming language and the Java class libraries.
zh_cn: Java平台从根本上设计为支持并发编程，在Java编程语言和Java类库中有基本的并发支持。

source: The Java programming language provides two basic synchronization idioms: synchronized methods and synchronized statements.
zh_cn: Java 编程语言中提供了两种基本的同步语法： 同步方法（synchronized methods） 和 同步代码块（synchronized statements）。

source: The Java™ Tutorials
zh_cn: Java教程

source: The SimpleThreads Example
zh_cn: SimpleThreads 示例

source: The application should print out "Mares do eat oats." Is it guaranteed to always do this?
zh_cn: 应用程序应打印出“Mares do eat oats.”。 是否保证永远这样做？

source: The atomic compareAndSet method also has these memory consistency features, as do the simple atomic arithmetic methods that apply to integer atomic variables.
zh_cn: 原子的 compareAndSet 方法也有内存一致性特点，就像应用到整型原子变量中的简单原子算法。

source: The biggest advantage of Lock objects over implicit locks is their ability to back out of an attempt to acquire a lock.
zh_cn: Lock 对象之于隐式锁最大的优势在于，它们有能力收回获得锁的尝试。

source: The blurred destination image is also represented by an integer array with the same size as the source.
zh_cn: 与 source 图片相同，模糊之后的 destination图片也由一个整数数组表示。

source: The causes of memory consistency errors are complex and beyond the scope of this tutorial.
zh_cn: 导致内存一致性错误的原因很复杂，超出了本教程的描述范围。

source: The center of the fork/join framework is the ForkJoinPool class, an extension of the AbstractExecutorService class.
zh_cn: fork/join 框架的核心是 ForkJoinPool 类，它是对 AbstractExecutorService 类的扩展。

source: The class itself is declared final.
zh_cn: 类本身被声明为 final 。

source: The class, SynchronizedRGB, defines objects that represent colors.
zh_cn: SynchronizedRGB类定义了一个表示颜色的类。

source: The consumer thread, defined in Consumer, simply retrieves the messages and prints them out, until it retrieves the "DONE" string.
zh_cn: Consumer中定义的消费者线程，简单地读取消息并打印出来，直到读取到字符串“DONE”。

source: The effects of the code in the thread are now visible to the thread that performed the join.
zh_cn: 也就是说终止了的线程中的代码效果对调用 join 方法的线程来说是可见。

source: The effects of the code that led up to the creation of the new thread are visible to the new thread.
zh_cn: 引入并创建这个新线程的代码产生的结果对该新线程来说都是可见的。

source: The executor implementations in java.util.concurrent are designed to make full use of the more advanced ExecutorService and ScheduledExecutorService interfaces, although they also work with the base Executor interface.
zh_cn: java.util.concurrent 中p实现的执行器旨在充分利用更高级的 ExecutorService 和 ScheduledExecutorService 接口，尽管它们也可以使用基本的Executor接口。

source: The expression c-- can be decomposed the same way, except that the second step decrements instead of increments.
zh_cn: 表达式 c-- 也是会被按照同样的方式进行翻译，只不过第二步变成了减1，而不是加1。

source: The first idiom, which employs a Runnable object, is more general, because the Runnable object can subclass a class other than Thread.
zh_cn: 第一种方式,它使用 Runnable 对象,在实际应用中更普遍,因为Runnable对象可以继承Thread 以外的类。

source: The first is the main thread that every Java application has.
zh_cn: 第一个线程是每个 Java 应用程序都有主线程。

source: The first one, set, arbitrarily transforms the object, and has no place in an immutable version of the class.
zh_cn: 第一个， set ，它任意地改这个对象，并且在该类的不可变版本中没有位置（译注：应该就是不需要的意思）。

source: The first step for using the fork/join framework is to write code that performs a segment of the work.
zh_cn: 使用 fork/join 框架的第一步是编写执行一部分工作的代码。

source: The following example brings together some of the concepts of this section.
zh_cn: 以下示例汇集了本课程的一些概念。

source: The following rules define a simple strategy for creating immutable objects.
zh_cn: 以下规则定义了创建不可变对象的简单策略。

source: The following subsections describe executors in detail.
zh_cn: 接下来的部分将讲详细描述执行器。

source: The following subsections take a class whose instances are mutable and derives a class with immutable instances from it.
zh_cn: 接下来看一个可变对象的类，然后转化为一个不可变对象的类。

source: The fork/join framework is an implementation of the ExecutorService interface that helps you take advantage of multiple processors.
zh_cn: 框架是 ExecutorService 接口的一种具体实现，目的是为了帮助你更好地利用多处理器带来的好处。

source: The fork/join framework is distinct because it uses a work-stealing algorithm.
zh_cn: fork/join 框架的独特之处在与它使用工作窃取（work-stealing）算法。

source: The goal is to use all the available processing power to enhance the performance of your application.
zh_cn: 目标是使用所有可用的处理能力来提高应用程序的性能。

source: The impact of object creation is often overestimated, and can be offset by some of the efficiencies associated with immutable objects.
zh_cn: 实际上这种开销常常被过分高估，而且使用不可变对象所带来的一些效率提升也抵消了这种开销。

source: The interrupt mechanism is implemented using an internal flag known as the interrupt status.
zh_cn: 中断机制使用被称为 interrupt status的内部标志来实现。

source: The invocation of wait does not return until another thread has issued a notification that some special event may have occurred  though not necessarily the event this thread is waiting for:
zh_cn: 调用 wait 不会返回，直到另一线程发出一个可能发生的特殊事件的通知——尽管通知的事件不一定是这个线程正在等待的事件：

source: The key to avoiding memory consistency errors is understanding the happens-before relationship.
zh_cn: 避免出现内存一致性错误的关键在于理解happens-before 关系。

source: The lock release occurs even if the return was caused by an uncaught exception.
zh_cn: 即使是由于出现了没有被捕获的异常而导致方法返回，该锁也会被释放。

source: The low-level idiom creates a new thread and launches it immediately.
zh_cn: 低级的方法是创一个线程并立即启动。

source: The main thread creates a new thread from the Runnable object, MessageLoop, and waits for it to finish.
zh_cn: 主线程从 Runnable 对象， MessageLoop ，创建一个新线程，并等待它完成。

source: The more complex of the two, synchronized statements, are described in the next section.
zh_cn: 两者中同步代码块相对而言更为复杂一些，我们将在下一小节中进行描述。

source: The most common coordination idiom is the guarded block.
zh_cn: 最常见的方式是使用 guarded block。

source: The non-static isInterrupted method, which is used by one thread to query the interrupt status of another, does not change the interrupt status flag.
zh_cn: 非静态 isInterrupted方法，它是用于线程来查询另一个线程的中断状态，不会改变中断状态标志

source: The original source image is represented by an array of integers, where each integer contains the color values for a single pixel.
zh_cn: 原始的 source 图片由一个整数的数组表示，每个整数表示一个像素点的颜色数值。

source: The other methods are invoked from other threads involved in managing the thread and Thread object.
zh_cn: 其他方法是从涉及管理线程和线程对象的其他线程调用的。

source: The other thread will block when it attempts to acquire the lock.
zh_cn: 其他线程在尝试获取该锁时将被阻塞。

source: The producer thread, defined in Producer, sends a series of familiar messages.
zh_cn: Producer中定义的生产者线程，发送一系列相似的消息。

source: The second idiom is easier to use in simple applications, but is limited by the fact that your task class must be a descendant of Thread.
zh_cn: 第二种方式，在简单的应用程序更容易使用,但受限于你的任务类必须是一个 Thread的后代。

source: The second one, invert, can be adapted by having it create a new object instead of modifying the existing one.
zh_cn: 第二个 invert 可以调整为：通过创建一个新对象而不是修改现有对象。

source: The simplest way to do this is to declare the class as final.
zh_cn: 简单的方法是将该类申明为final。

source: The standard general-purpose implementation of ConcurrentNavigableMap is ConcurrentSkipListMap, which is a concurrent analog of TreeMap.
zh_cn: ConcurrentNavigableMap 的标准的一般目的的实现是 ConcurrentSkipListMap，它是 TreeMap的并发模式。

source: The standard general-purpose implementation of ConcurrentMap is ConcurrentHashMap, which is a concurrent analog of HashMap.
zh_cn: ConcurrentMap 的标准的一般目的的实现是 ConcurrentHashMap，它是HashMap的并发模式。

source: The string "DONE" indicates that all messages have been sent.
zh_cn: 字符串“DONE”表示所有消息都已经发送。

source: The tool needed to prevent these errors is synchronization.
zh_cn: 防止这些错误所需的工具是synchronization。

source: The two threads communicate using a shared object.
zh_cn: 两个线程使用共享对象进行通信。

source: Then it might be modified as follows to support interrupts:
zh_cn: 那么可能会如下修改以支持中断：

source: Then it must periodically invoke Thread.interrupted, which returns true if an interrupt has been received.
zh_cn: 那么它必须定期调用 Thread.interrupted，在收到中断后，它会返回true。

source: Then, shortly afterwards, thread B prints out counter:
zh_cn: 然后，不久之后，线程B打印counter的值：

source: There are a number of steps to follow in order to do this correctly.
zh_cn: 为了正确执行，需要遵循以下步骤。

source: There are also new concurrent data structures in the Java Collections Framework.
zh_cn: Java 集合框架中也定义了新的并发数据结构。

source: There are several actions that create happens-before relationships.
zh_cn: 我们可以采取多种方式建立这种 happens-before 关系。

source: There are two basic strategies for using Thread objects to create a concurrent application.
zh_cn: 有两种使用线程 对象来创建并发应用程序的基本策略：

source: There are two setter methods in this class.
zh_cn: 访类中有两个set方法。

source: There are two ways to do this:
zh_cn: 有两种方式来这样做：

source: Therefore, no safeguards against changing the state of "contained" mutable objects are necessary.
zh_cn: 因此，不能改变“包含”可变对象的状态的保障措施是必要的。

source: These APIs are adequate for very basic tasks, but higher-level building blocks are needed for more advanced tasks.
zh_cn: 这些API 对于非常基本的任务来说已经足够，但是对于更高级的任务就需要更高级的 API。

source: These are most easily categorized by the collection interfaces provided:
zh_cn: 它们也最容易按照集合类所提供的接口来进行分类：

source: These include static methods, which provide information about, or affect the status of, the thread invoking the method.
zh_cn: 包括一些 static 方法，它们提供有关调用该方法的线程的信息或影响线程的状态。

source: These include decreased overhead due to garbage collection, and the elimination of code needed to protect mutable objects from corruption.
zh_cn: 例如：使用不可变对象降低了垃圾回收所产生的额外开销，也减少了用来确保使用可变对象不出现并发错误的一些额外代码。

source: These methods are similar to sort(), but leverage concurrency via the fork/join framework.
zh_cn: 这些方法类似于sort()，但是通过fork/join框架来利用并发性。

source: These operations remove or replace a key-value pair only if the key is present, or add a key-value pair only if the key is absent.
zh_cn: 移除或者替换键值对的操作只有当 key 存在时才能进行，而新增操作只有当 key 不存在时。

source: They assume that they can continue to work in a word processor, while other applications download files, manage the print queue, and stream audio.
zh_cn: 他们假设他们可以继续在文字处理器中工作，而其他应用程序下载文件，管理打印队列和流音频。

source: They're still blocking each other, so...
zh_cn: 他们仍然阻止对方，所以...

source: This allows interrupt handling code to be centralized in a catch clause.
zh_cn: 这允许中断处理代码集中在一个 catch 子句中。

source: This depends on what it's currently doing.
zh_cn: 这取决于它当前在做什么。

source: This describes a situation where synchronized code, directly or indirectly, invokes a method that also contains synchronized code, and both sets of code use the same lock.
zh_cn: 它是这样的一种情况：在同步代码中直接或者间接地调用了还有同步代码的方法，两个同步代码段中使用的是同一个锁。

source: This does not necessarily mean the creators of these classes were sloppy  they may have good reason for believing that instances of their classes never change after construction.
zh_cn: 不过这不是编写这些类的程序员们粗心大意造成的，很可能的是他们有充分的理由确保这些对象在创建后不会被修改。

source: This example application, Deadlock, models this possibility:
zh_cn: 这个示例应用程序中， 死锁模型是这样的：

source: This executor is suitable for applications that launch many short-lived tasks.
zh_cn: 这个执行器适用于会启动许多短暂任务的应用程序。

source: This form of communication is extremely efficient, but makes two kinds of errors possible: thread interference and memory consistency errors.
zh_cn: 这种形式的通信是非常有效的，但可能导致2种可能的错误：线程干扰（ thread interference）和内存一致性错误（ memory consistency errors）。

source: This greatly enhances a system's capacity for concurrent execution of processes and threads  but concurrency is possible even on simple systems, without multiple processors or execution cores.
zh_cn: 这大大增强了系统的进程和线程的并发执行能力。但即便是没有多处理器或多进程的系统中，并发仍然是可能的。

source: This guarantees that changes to the state of the object are visible to all threads.
zh_cn: 这就确保了对该对象的修改对其他线程是可见的。

source: This happens when shared resources are made unavailable for long periods by "greedy" threads.
zh_cn: 这种情况一般出现在共享资源被某些“贪婪”线程占用，而导致资源长时间不能被其他线程可用。

source: This is an efficient means of making processor time available to the other threads of an application or other applications that might be running on a computer system.
zh_cn: 这是使处理器时间可用于应用程序的其他线程或可能在计算机系统上运行的其他应用程序的有效手段。

source: This is an exception that sleep throws when another thread interrupts the current thread while sleep is active.
zh_cn: 当 sleep 处于活动状态时，另一个线程中断当前线程时， sleep 将抛出异常。

source: This is comparable to two people attempting to pass each other in a corridor: Alphonse moves to his left to let Gaston pass, while Gaston moves to his right to let Alphonse pass.
zh_cn: 现实中的例子是，两人面对面试图通过一条走廊：Alphonse 移动到他的左则让路给 Gaston ，而 Gaston 移动到他的右侧想让 Alphonse 过去。

source: This is especially true for massively concurrent applications that fully exploit today's multiprocessor and multi-core systems.
zh_cn: 对于充分利用当今多处理器和多核系统的大规模并发应用程序尤其如此。

source: This is the usage emphasized in this lesson.
zh_cn: 这是本课中强调的使用方法。

source: This is true even in systems that only have a single execution core, and thus only have one thread actually executing at any given moment.
zh_cn: 实际上，在给定的时间内，每个处理器只能有一个线程得到真正的运行。

source: This kind of application shares data between two threads: the producer, that creates the data, and the consumer, that does something with it.
zh_cn: 这类应用需要在两个线程之间共享数据： 生产者（producer）生产数据，消费者（consumer）使用数据。

source: This kind of inconsistency is only possible for mutable objects  it will not be an issue for the immutable version of SynchronizedRGB.
zh_cn: 这种不一致的问题只可能发生在可变对象上——在不可变对象版本的SynchronizedRGB上，这将不是问题。

source: This kind of lock is easy to use, but has many limitations.
zh_cn: 这种锁是易于使用，但有许多限制。

source: This kind of thread exists separately from the Runnable and Callable tasks it executes and is often used to execute multiple tasks.
zh_cn: 工作线程独立于所它所执行的 Runnable 任务和 Callable 任务，并且常用来执行多个任务。

source: This lesson focuses on the first approach, which separates the Runnable task from the Thread object that executes the task.
zh_cn: 本课程推荐使用第一种方法,将 Runnable 任务从 Thread 对象中分离来执行任务。

source: This lesson introduces the platform's basic concurrency support and summarizes some of the high-level APIs in the java.util.concurrent packages.
zh_cn: 本课介绍了平台的基本并发支持，并总结了java.util.concurrent包中的一些高级API。

source: This makes for efficient, but potentially problematic, communication.
zh_cn: 这使得工作变得高效，但也存在了一个潜在的问题——通信。

source: This means that changes to a volatile variable are always visible to other threads.
zh_cn: 这就意味着对volatile 类型变量的修改对于别的线程来说是可见的。

source: This means that the two operations consist of multiple steps, and the sequences of steps overlap.
zh_cn: 这就意味着操作是由多个步骤构成的，而此时，在这多个步骤的执行上出现了叠加。

source: This relationship is simply a guarantee that memory writes by one specific statement are visible to another specific statement.
zh_cn: 这种关系是一种简单的方法，能够确保一条语句对内存的写操作对于其它特定的语句都是可见的。

source: This section covers the following topics:
zh_cn: 该部分涵盖以下主题：

source: This section describes the most common kind of liveness problem, deadlock, and goes on to briefly describe two other liveness problems, starvation and livelock.
zh_cn: 本节将介绍最常见的一种活跃度的问题——死锁（deadlock），并且简要介绍另外两个活跃度问题饥饿（starvation）和活锁（livelock）。

source: This section documents the use of Thread objects.
zh_cn: 本节介绍使用线程 对象。

source: This section is about synchronized methods.
zh_cn: 本节重点讨论同步方法。

source: This thread also pauses for random intervals.
zh_cn: 这个线程也会暂停随机的间隔。

source: This thread has the ability to create additional threads, as we'll demonstrate in the next section.
zh_cn: 这个线程有能力创建额外的线程。正如我们将在下一部分展示的。

source: This type of pool always has a specified number of threads running; if a thread is somehow terminated while it is still in use, it is automatically replaced with a new thread.
zh_cn: 这种线程池始终有一定数量的线程在运行，如果一个线程由于某种原因终止运行了，线程池会自动创建一个新的线程来代替它。

source: This works well for small applications, but in large-scale applications, it makes sense to separate thread management and creation from the rest of the application.
zh_cn: 但对于大规模并发应用来说，合理的做法是将线程的创建与管理和程序的其他部分分离开。

source: Though this is a general programming guide, its chapter on threads contains essential "best practices" for concurrent programming.
zh_cn: 虽然这是常规的编程指南，但是它的线程章节包含了并发编程的基本“最佳实践”。

source: Thread A's result is lost, overwritten by Thread B. This particular interleaving is only one possibility.
zh_cn: 这样线程 A 计算的值就丢失了，也就是被线程 B 的值覆盖了。上面的这种“交错”只是其中的一种可能性。

source: Thread A: Increment retrieved value; result is 1.
zh_cn: Thread A: 对获取到的值加1；其结果是1。

source: Thread A: Retrieve c.
zh_cn: Thread A: 获取 c 的值。

source: Thread A: Store result in c; c is now 1.
zh_cn: Thread A: 将结果存储到 c 中；此时c的值是1。

source: Thread B: Decrement retrieved value; result is -1.
zh_cn: Thread B: 对获取到的值减1；其结果是-1。

source: Thread B: Retrieve c.
zh_cn: Thread B: 获取 c 的值。

source: Thread B: Store result in c; c is now -1.
zh_cn: Thread B: 将结果存储到 c 中；此时c的值是-1。

source: Thread Interference
zh_cn: 线程干扰

source: Thread Objects
zh_cn: 线程对象

source: Thread Pools
zh_cn: 线程池

source: Thread objects use a significant amount of memory, and in a large-scale application, allocating and deallocating many thread objects creates a significant memory management overhead.
zh_cn: 在大规模并发应用中，创建大量的 Thread 对象会占用占用大量系统内存，分配和回收这些对象会产生很大的开销。

source: Threads
zh_cn: 线程

source: Threads are sometimes called lightweight processes.
zh_cn: 线程有时被称为轻量级进程（ lightweight processes）。

source: Threads communicate primarily by sharing access to fields and the objects reference fields refer to.
zh_cn: 线程间的通信主要是通过共享访问字段以及其字段所引用的对象来实现的。

source: Threads exist within a process  every process has at least one.
zh_cn: 线程中存在于进程中,每个进程都至少一个线程。

source: Threads often have to coordinate their actions.
zh_cn: 多线程之间经常需要协同工作。

source: Threads share the process's resources, including memory and open files.
zh_cn: 线程共享进程的资源,包括内存和打开的文件。

source: Thus access to class's static fields is controlled by a lock that's distinct from the lock for any instance of the class.
zh_cn: 因此，访问类的静态字段是由一个锁控制的，该锁与任何该类的实例的锁都不同。

source: To abstract thread management from the rest of your application, pass the application's tasks to an executor.
zh_cn: 通过传递给应用程序任务给一个 executor，从而从应用程序的其他部分抽象出线程管理。

source: To avoid re-inventing the wheel, examine the existing data structures in the Java Collections Framework before trying to code your own data-sharing objects.
zh_cn: 为了避免重复造轮子，请在尝试编写自己的数据共享对象之前，先查看 Java Collections Framework 中的现有数据结构。

source: To avoid this outcome, the two statements must be bound together:
zh_cn: 为了避免出现这样的结果，必须要像把这两条语句绑定到一块执行：

source: To demonstrate the versatility of this idiom, we assume that Alphonse and Gaston are so infatuated with their newfound ability to bow safely that they can't stop bowing to each other:
zh_cn: 为了说明这个成语的多功能性，我们假设Alphonse和Gaston如此迷恋着他们的新发现能力，安全地鞠躬，他们不能停止彼此的鞠躬。

source: To directly control thread creation and management, simply instantiate Thread each time the application needs to initiate an asynchronous task.
zh_cn: 为了直接控制线程的创建和管理，简单地初始化线程，应用程序每次需要启动一个异步任务。

source: To facilitate communication between processes, most operating systems support Inter Process Communication (IPC) resources, such as pipes and sockets.
zh_cn: 大多数操作系统都支持进程间通信( Inter Process Communication (IPC) 资源,如pipes 和 sockets。

source: To help you understand how the fork/join framework works, consider the following example.
zh_cn: 想要了解 fork/join 框架的基本工作原理，接下来的这个例子会有所帮助。

source: To make a method synchronized, simply add the synchronized keyword to its declaration:
zh_cn: 要同步一个方法，简单地在方法声明中添加synchronized 关键字即可：

source: To see how this package might be used, let's return to the Counter class we originally used to demonstrate thread interference:
zh_cn: 为了看看这个包如何使用，让我们返回到最初用于演示线程干扰的 Counter 类：

source: To see this, consider the following example.
zh_cn: 为了理解这点，我们可以考虑如下的示例。

source: To simulate the unpredictable nature of real-world applications, the producer thread pauses for random intervals between messages.
zh_cn: 为了模拟现实情况，生产者线程还会在消息发送时随机的暂停。

source: To support immediate shutdown, tasks should handle interrupts correctly.
zh_cn: 要技持立即关闭，任务需要正确地处理 interrupts 。

source: To understand this, consider a web server application where each HTTP request is handled by a separate thread.
zh_cn: 要理解这一点，例如一个 Web 服务器，每一个 HTTP 请求都是由一个单独的线程来处理的。

source: Two overloaded versions of sleep are provided: one that specifies the sleep time to the millisecond and one that specifies the sleep time to the nanosecond.
zh_cn: 提供了两个重载的 sleep 方法：一个指定睡眠时间为毫秒，一个指定睡眠时间为纳秒。

source: Typically, variables that refer to executor objects are declared as one of these three interface types, not with an executor class type.
zh_cn: 通常来说，指向 executor 对象的变量应被声明为以上三种接口之一，而不是具体的实现类。

source: Under different circumstances it might be Thread B's result that gets lost, or there could be no error at all.
zh_cn: 在不同的系统环境中，有可能是 B 线程的结果丢失了，或者是根本就不会出现错误。

source: Unfortunately, this rule does not account for the possibility that two friends might bow to each other at the same time.
zh_cn: 不幸的是，这条规则并没有考虑这种可能性：两个朋友同时向对方鞠躬。

source: Unlike synchronized methods, synchronized statements must specify the object that provides the intrinsic lock:
zh_cn: 与同步方法不同，同步语名块必须指定提供内在锁的对象：

source: Use this idiom with extreme care.
zh_cn: 采用这种方式时需要特别的小心。

source: Using volatile variables reduces the risk of memory consistency errors, because any write to a volatile variable establishes a happens-before relationship with subsequent reads of that same variable.
zh_cn: 使用 volatile 变量可以减少内存一致性错误的风险，因为任何对volatile 变量的写操作都和后续对该变量的读操作建立了happens-before关系。

source: Using simple atomic variable access is more efficient than accessing these variables through synchronized code, but requires more care by the programmer to avoid memory consistency errors.
zh_cn: 使用简单的原子变量访问比通过同步代码来访问变量更高效，但是需要程序员的更多细心考虑，以避免内存一致性错误。

source: Using worker threads minimizes the overhead due to thread creation.
zh_cn: 使用工作线程可以使创建线程的开销最小化。

source: We have already seen that an increment expression, such as c++, does not describe an atomic action.
zh_cn: 通过前面的示例，我们已经发现了诸如 c++这样的自增表达式并不属于原子操作。

source: We model this improvement by requiring that our Friend objects must acquire locks for both participants before proceeding with the bow.
zh_cn: 我们通过要求Friend 对象在双方鞠躬前，必须先获取双方 的锁，来模拟这次改善。
